propeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        innerCylinder;

    solidBodyMotionFunction  rotatingMotion;

    origin      (0 0 0);
    axis        (0 1 0);

    // rpm         -3000;
    rpm     table
      (
       (0      -3000)   // t=0 s → 3000 rpm
       (0.01   -5000)   // t=0.01 s → 5000 rpm
       (0.02  -10000)   // t=0.02 s → 10000 rpm
       (0.03  -15000)   // t=0.03 s → 15000 rpm
       (0.04  -20000)   // t=0.03 s → 15000 rpm
       (0.05  -25000)   // t=0.03 s → 15000 rpm
       (0.06  -30000)   // t=0.03 s → 15000 rpm
       );
}


// ************************************************************************* //
